<a href="https://colab.research.google.com/github/AnhVietPham/Computer-Science/blob/master/research-pandas/Pandas_df_drop_duplicates.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://www.sharpsightlabs.com/blog/pandas-drop-duplicates/

https://www.geeksforgeeks.org/python-pandas-dataframe-drop_duplicates/

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv("/content/employees.csv")

data.sort_values("First Name")
data.head(10)

  First Name  Gender  ... Senior Management                  Team
0    Douglas    Male  ...              True             Marketing
1     Thomas    Male  ...              True                   NaN
2      Maria  Female  ...             False               Finance
3      Jerry    Male  ...              True               Finance
4      Larry    Male  ...              True       Client Services
5     Dennis    Male  ...             False                 Legal
6       Ruby  Female  ...              True               Product
7        NaN  Female  ...               NaN               Finance
8     Angela  Female  ...              True           Engineering
9    Frances  Female  ...              True  Business Development

[10 rows x 8 columns]

# **Inplace = False**

In [42]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [48]:
df.drop_duplicates(inplace=False)

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [49]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

# **Inplace = True**

In [53]:
df2 = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df2

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [54]:
df2.drop_duplicates(inplace=True)

In [55]:
df2

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

# **subset**

In [58]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [59]:
df.drop_duplicates(subset=['brand'])

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

# **Keep**

In [56]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [62]:
df.drop_duplicates(subset=['brand'],keep='last')

     brand style  rating
1  Yum Yum   cup     4.0
4  Indomie  pack     5.0